function fizzbuzz_3(){

  //チャレンジャー３さんのtextareaを取得
  var elem = document.getElementById("code-result-3");

  //◆関数のアルゴリズム
  //  ・1から100の数字を順に出力する
  //　・3で割り切れる場合は"Fizz"
  //　・5で割り切れる場合は"Buzz"
  //　・3でも5でも割り切れる場合は"FizzBuzz"
  //　・上述の条件以外はそのままの数字
  //　・出力結果は1行ずつ改行する
  //　・FizzBuzz出力処理の最終行は"Finish"と出力する

  //Javascriptコードサンプル
  ////   ◆変数宣言
  // var str = "aaaa";
  // var cnt = 123;

  ////   ◆繰り返し
  // for (var i = 0; i < array.length; i++) {
  //   array[i]
  // }

  ////   ◆真偽判定
  // if (true) {
  //
  // } else if (true) {
  //
  // } else {
  //
  // }

  ////   ◆算術演算子
  // +　加算演算子
  // -　減算演算子
  // /　除算演算子
  // *　乗算演算子
  // %　剰余演算子

  ////   ◆等値演算子
  // ==　等値演算子
  // !=　不等値演算子

  ////   ◆バイナリ論理演算子
  // &&　論理積 (AND)
  // ||　論理和 (OR)

  /* ここからコード実装==============================*/

  /* ==============================ここまでコード実装*/

  //処理の結果（XXX）をtextareaの値に設定
  elem.value = XXXX;
}
